-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-04-04 19:38:23
-- 伺服器版本： 10.4.18-MariaDB
-- PHP 版本： 8.0.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `mydatabase`
--

-- --------------------------------------------------------

--
-- 資料表結構 `tree_viewing`
--

CREATE TABLE `tree_viewing` (
  `id` int(255) NOT NULL,
  `item` int(255) NOT NULL,
  `area` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `location` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `species` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `flowering` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `tree_viewing`
--

INSERT INTO `tree_viewing` (`id`, `item`, `area`, `location`, `species`, `flowering`) VALUES
(1, 1, '中區', '綠川親水步道', '洋紅風鈴木', '3-4月'),
(2, 2, '東區', '大智公園', '洋紅風鈴木', '2-3月'),
(3, 3, '東區', '大智公園', '阿勃勒', '5-6月'),
(4, 4, '東區', '樂成公園', '黃花風鈴木', '3-4月'),
(5, 5, '東區', '東英公園', '洋紅風鈴木', '3-4月'),
(6, 6, '東區', '東英公園', '花旗木', '3-4月'),
(7, 7, '南區', '興大綠川河岸', '洋紅風鈴木', '3-4月'),
(8, 8, '南區', '中興大學園道', '阿勃勒', '5-6月'),
(9, 9, '南區', '中興大學', '樟樹', '常綠'),
(10, 10, '南區', '中興大學', '大葉桃花心木', '常綠'),
(11, 11, '南區', '中興大學', '楓樹', '11-12月'),
(12, 12, '南區', '中興大學', '光臘樹', '5-6月'),
(13, 13, '南區', '中興大學旁地下道', '小葉欖仁', '4-11月'),
(14, 14, '南區', '半平厝公園', '阿勃勒', '5-6月'),
(15, 15, '南區', '半平厝公園', '洋紫荊', '3-4月'),
(16, 16, '南區', '忠明南路及工學二街綠園道', '洋紅風鈴木', '3-4月'),
(17, 17, '南區', '樹義園道', '垂榕', '常綠'),
(18, 18, '南區', '半平厝公園', '緬梔', '5-6月'),
(19, 19, '西區', '綠園道', '羊蹄甲', '3-4月'),
(20, 20, '西區', '大墩文化中心', '鳳凰木', '1-4月'),
(21, 21, '西區', '梅川園道', '阿勃勒', '5-6月'),
(22, 22, '西區', '國立臺灣美術館', '樟樹', '常綠'),
(23, 23, '西區', '國立臺灣美術館', '阿勃勒', '5-6月'),
(24, 24, '西區', '茄苳公園', '茄苳', '常綠'),
(25, 25, '西區', '英才郵局', '藍花楹', '4-6月'),
(26, 26, '西區', '東興公園', '阿勃勒', '5-6月'),
(27, 27, '西區', '麻園頭溪畔', '烏臼', '11-3月'),
(28, 28, '西區', '麻園頭溪畔', '臺灣欒樹', '9-10月'),
(29, 29, '西區', '經國綠園道', '艷紫荊', '10-3月'),
(30, 30, '北區', '崇德榕園', '櫻花', '3-4月'),
(31, 31, '北區', '崇德榕園', '榕樹', '常綠'),
(32, 32, '北區', '立人國中', '洋紅風鈴木', '2-3月'),
(33, 33, '北區', '立人國中', '臺灣欒樹', '9-10月'),
(34, 34, '北區', '自然科學博物館', '流蘇', '3-4月'),
(35, 35, '北區', '自然科學博物館植物園', '楓香', '2-3月、10-12月'),
(36, 36, '北區', '自然科學博物館植物園', '黃連木', '11-3月'),
(37, 37, '北區', '太原綠園道', '藍花楹', '4-6月'),
(38, 38, '北區', '英才公園', '大花紫薇', '5-6月'),
(39, 39, '北區', '英才公園', '鳳凰木', '5-7月'),
(40, 40, '北區', '英才公園', '櫻花', '2-3月'),
(41, 41, '北區', '英才公園', '阿勃勒', '5-6月'),
(42, 42, '北區', '中正公園', '黃花風鈴木', '2-3月'),
(43, 43, '西屯區', '文修公園', '黃花風鈴木', '2-3月'),
(44, 44, '西屯區', '市政公園', '櫻花', '2-3月'),
(45, 45, '西屯區', '龍洋橋頭', '楝樹', '3-4月'),
(46, 46, '西屯區', '福科國中', '櫻花', '2-3月'),
(47, 47, '西屯區', '福科國中', '黃花風鈴木', '3-4月'),
(48, 48, '西屯區', '大容東西街', '垂榕', '常綠'),
(49, 49, '西屯區', '東海大學', '鳳凰木', '5-7月'),
(50, 50, '西屯區', '東海大學', '榕樹', '常綠'),
(51, 51, '西屯區', '東海大學', '木棉', '3-4月'),
(52, 52, '西屯區', '三信公園', '苦楝', '3-4月'),
(53, 53, '西屯區', '潮洋環保公園', '洋紅風鈴木', '3-4月'),
(54, 54, '西屯區', '福星公園', '阿勃勒', '5-6月'),
(55, 55, '西屯區', '公137', '苦楝', '3-4月'),
(56, 56, '西屯區', '公137', '藍花楹', '6-7月'),
(57, 57, '西屯區', '福裕公園', '大花紫薇', '5-6月'),
(58, 58, '西屯區', '安和公園', '大花紫薇', '5-6月'),
(59, 59, '西屯區', '協和公園', '大花紫薇', '5-6月'),
(60, 60, '西屯區', '西大墩公園', '黃花風鈴木', '2-3月'),
(61, 61, '西屯區', '西大墩公園', '苦楝', '3-4月'),
(62, 62, '西屯區', '逢甲公園', '臺灣欒樹', '9-10月'),
(63, 63, '西屯區', '潮洋環保公園', '阿勃勒', '5-6月'),
(64, 64, '南屯區', '文心森林公園', '楝樹', '3-4月'),
(65, 65, '南屯區', '豐富公園', '黃花風鈴木', '2-3月'),
(66, 66, '南屯區', '豐樂雕塑公園', '洋紅風鈴木', '3-4月'),
(67, 67, '南屯區', '東興國小', '大花紫薇', '5-6月'),
(68, 68, '南屯區', '楓樹腳溪畔', '楓香', '2-3月\n10-12月'),
(69, 69, '南屯區', '黎明新村-干城街', '流蘇', '3-4月'),
(70, 70, '南屯區', '黎明新村-干城街', '楓香', '10-12月'),
(71, 71, '南屯區', '文心森林公園', '阿勃勒', '5-6月'),
(72, 72, '南屯區', '文心森林公園', '鳳凰木', '5-7月'),
(73, 73, '南屯區', '文心森林公園', '緬梔', '5-6月'),
(74, 74, '南屯區', '文心森林公園', '臺灣欒樹', '9-10月'),
(75, 75, '南屯區', '豐富公園', '緬梔', '5-6月'),
(76, 76, '南屯區', '豐樂雕塑公園', '阿勃勒', '5-6月'),
(77, 77, '南屯區', '豐樂雕塑公園', '藍花楹', '6-7月'),
(78, 78, '南屯區', '豐樂雕塑公園', '大花紫薇', '6-7月'),
(79, 79, '南屯區', '豐樂雕塑公園', '櫻花', '2-3月'),
(80, 80, '南屯區', '豐樂雕塑公園', '臺灣欒樹', '9-10月'),
(81, 81, '北屯區', '文昌國小', '櫻花', '1-4月'),
(82, 82, '北屯區', '?子公園', '黃花風鈴木', '2-3月'),
(83, 83, '北屯區', '臺中洲際棒球場', '小葉欖仁', '4-11月'),
(84, 84, '北屯區', '新都生態公園', '落羽松', '12-2月'),
(85, 85, '北屯區', '松勇公園', '藍花楹', '4-6月'),
(86, 86, '北屯區', '松勇公園', '洋紅風鈴木', '3-4月'),
(87, 87, '北屯區', '仁美國小', '藍花楹', '4-6月'),
(88, 88, '北屯區', '旱溪東路三段', '阿勃勒', '5-6月'),
(89, 89, '北屯區', '中臺科大-?子路', '臺灣欒樹', '9-10月'),
(90, 90, '北屯區', '仁和公園', '羊蹄甲', '3-5月'),
(91, 91, '北屯區', '?興公園', '黃花風鈴木', '2-3月'),
(92, 92, '北屯區', '?子公園', '大花紫薇', '5-6月'),
(93, 93, '北屯區', '新都生態公園', '大花紫薇', '5-6月'),
(94, 94, '北屯區', '新都生態公園', '阿勃勒', '5-6月'),
(95, 95, '北屯區', '?興公園', '大花紫薇', '5-6月'),
(96, 96, '豐原區', '豐村國小', '藍花楹', '4-6月'),
(97, 97, '東勢區', '東勢木棉道', '木棉', '3-4月'),
(98, 98, '東勢區', '東勢林場', '櫻花', '2-3月'),
(99, 99, '東勢區', '東勢林場', '楓樹', '11-12月'),
(100, 100, '東勢區', '東勢林場', '梅花', '12-1月'),
(101, 101, '東勢區', '東勢林場', '油桐樹', '3-5月'),
(102, 102, '東勢區', '東勢林場', '大花紫薇', '5-6月'),
(103, 103, '大甲區', '鐵砧山中正公園', '櫻花', '3-4月'),
(104, 104, '大甲區', '泰安派出所', '櫻花', '2-3月'),
(105, 105, '大甲區', '大甲高工', '木棉', '3-4月'),
(106, 106, '沙鹿區', '弘光科技大學', '羊蹄甲', '3-4月'),
(107, 107, '沙鹿區', '公館公園', '相思樹', '4-6月'),
(108, 108, '沙鹿區', '公館公園', '雀榕', '6-11月'),
(109, 109, '沙鹿區', '公館公園', '樟樹', '常綠'),
(110, 110, '沙鹿區', '公明社區', '櫻花', '3-4月'),
(111, 111, '后里區', '三豐路旁', '黃花風鈴木', '3-4月'),
(112, 112, '神岡區', '圳前仁愛公園', '落羽松', '11-2月'),
(113, 113, '潭子區', '潭雅神綠園道', '楓香', '2-3月、10-12月'),
(114, 114, '潭子區', '潭雅神綠園道', '小葉欖仁', '常綠'),
(115, 115, '新社區', '新社區公所', '櫻花', '2-3月'),
(116, 116, '外埔區', '永豐水流東步道', '油桐樹', '4-5月'),
(117, 117, '大肚區', '瑞井里福德祠', '緬梔', '5-6月'),
(118, 118, '霧峰區', '亞洲大學', '阿勃勒', '5-6月'),
(119, 119, '太平區', '祥順運動公園', '合歡樹', '5-6月'),
(120, 120, '太平區', '興隆里興隆路旁', '樟樹', '常綠'),
(121, 121, '大里區', '大里運動公園', '艷紫荊', '10-3月'),
(122, 122, '大里區', '大里運動公園', '大果鐵刀木', '1-4月'),
(123, 123, '大里區', '大里運動公園', '苦楝', '3-4月'),
(124, 124, '大里區', '大里運動公園', '藍花楹', '4-6月'),
(125, 125, '大里區', '兒童藝術館', '洋紅風鈴木', '3-4月'),
(126, 126, '大里區', '立新國小', '大花紫薇', '5-6月'),
(127, 127, '大里區', '立新國小', '印度紫檀', '4-5月'),
(128, 128, '大里區', '十九甲健康公園', '火焰木', '4-5月'),
(129, 129, '和平區', '武陵農場', '紫藤', '3-4月'),
(130, 130, '和平區', '武陵農場', '銀杏', '3-4月'),
(131, 131, '和平區', '武陵農場', '楓樹', '11-12月'),
(132, 132, '和平區', '武陵農場', '櫻花', '2-3月'),
(133, 133, '和平區', '武陵農場', '落羽松', '11-2月'),
(134, 134, '和平區', '谷關溫泉區', '五葉松', '常綠'),
(135, 135, '和平區', '福壽山農場', '楓樹', '11-12月');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `tree_viewing`
--
ALTER TABLE `tree_viewing`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `tree_viewing`
--
ALTER TABLE `tree_viewing`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=136;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
